import 'package:flutter/material.dart';

class LanguageNotificationPage {
  final String text;

  LanguageNotificationPage({@required this.text});

  static List<LanguageNotificationPage> rus() {
    List<LanguageNotificationPage> list = [
      LanguageNotificationPage(
          text:
              '05.09.20 Произошло аварийное отключение на ТП100 К ТП99. Без электроснабжения находятся потребители по следующим адресам: улица Шайкенова, Аз Наурыз, Шолохова.'),
      LanguageNotificationPage(
          text:
              '07.09.20 В связи с проведением плановых работ для врезки водопровода Д=100мм., по адресу Заречный-2, будет прекращена подача водоснабжения '),
      LanguageNotificationPage(
          text:
              '10.09.20 «Актобе су арнасы» сообщает, что 28 сентября 2020 года будет отключение воды, в связи с устранением порыва Д=200мм. По адресу: улица Авиагородок 2'),
      LanguageNotificationPage(
          text:
              '15.09.20 Район: 8 микрорайон. В связи с проведением плановых ремонтных работ на ТП-344 1СШ будет преращена подача электроснабжения по следующим адресам: 8 мкр, дом 1-5.'),
      LanguageNotificationPage(
          text:
              '20.09.20 Район Кирпичный.  В связи с проведением преврезки теплотрассы Д=219 в сторону ул.Кирпичная,2 будет прекращена подача горячего водоснабжения по следующим адресам:ул.Кирпичная дом 1-10.'),
      LanguageNotificationPage(
          text:
              '21.09.20 Произошло аварийное отключение на ТП100 К ТП99. Без электроснабжения находятся потребители по следующим адресам: улица Шайкенова, Аз Наурыз, Шолохова.'),
      LanguageNotificationPage(
          text:
              '23.09.20 В связи с проведением плановых работ для врезки водопровода Д=100мм., по адресу Заречный-2, будет прекращена подача водоснабжения'),
      LanguageNotificationPage(
          text:
              '25.09.20 «Актобе су арнасы» сообщает, что 28 сентября 2020 года будет отключение воды, в связи с устранением порыва Д=200мм. По адресу: улица Авиагородок 2'),
      LanguageNotificationPage(
          text:
              '27.09.20 Район: 8 микрорайон. В связи с проведением плановых ремонтных работ на ТП-344 1СШ будет преращена подача электроснабжения по следующим адресам: 8 мкр, дом 1-5.'),
      LanguageNotificationPage(
          text:
              '30.09.20 Район Кирпичный.  В связи с проведением преврезки теплотрассы Д=219 в сторону ул.Кирпичная,2 будет прекращена подача горячего водоснабжения по следующим адресам:ул.Кирпичная дом 1-10.'),
    ];
    return list;
  }

  static List<LanguageNotificationPage> kaz() {
    List<LanguageNotificationPage> list = [
      LanguageNotificationPage(
          text:
              '05.09.20 TП100 K TП99 кезінде апаттық тоқтау орын алды. Электр желісіз тұтынушылар келесі мекен-жайлар бойынша бар: Шайкенов көшесі, Әз Наурыз, Шолохов'),
      LanguageNotificationPage(
          text:
              '07.09.20   D = 100мм су құбыры шүмегіне арналған жоспарлы жұмыстарға байланысты, Заречный-2 мекен-жайы бойынша сумен жабдықтау тоқтатылады.'),
      LanguageNotificationPage(
          text:
              '10.09.20 «Ақтөбе су арнасы» 2020 жылдың 28 қыркүйегінде D = 200мм құбыры шүмегінің жойылуына байланысты судың тоқтатылатынын хабарлайды. Мекен-жайы: Авиагородок көшесі 2'),
      LanguageNotificationPage(
          text:
              '15.09.20 Аудан: 8 шағын ауданы. ТП-344 1СШ жоспарланған жөндеу жұмыстарына байланысты электрмен жабдықтау келесі мекен-жайлар бойынша тоқтатылады: 8 шағын аудан, үй нөмірлері 1-5.'),
      LanguageNotificationPage(
          text:
              '0.09.20 Аудан: Кірпіш ауданы. Кирпичная көшесі,2 үй бағытында D = 219 жылу магистралін кесуге байланысты, ыстық су беру келесі мекен-жайлар бойынша тоқтатылады: Кирпичная көшесі, үй нөмірлері 1-10'),
      LanguageNotificationPage(
          text:
              '21.09.20 TП100 K TП99 кезінде апаттық тоқтау орын алды. Электр желісіз тұтынушылар келесі мекен-жайлар бойынша бар: Шайкенов көшесі, Әз Наурыз, Шолохов.'),
      LanguageNotificationPage(
          text:
              '23.09.20   D = 100мм су құбыры шүмегіне арналған жоспарлы жұмыстарға байланысты, Заречный-2 мекен-жайы бойынша сумен жабдықтау тоқтатылады.'),
      LanguageNotificationPage(
          text:
              '25.09.20 «Ақтөбе су арнасы» 2020 жылдың 28 қыркүйегінде D = 200мм құбыры шүмегінің жойылуына байланысты судың тоқтатылатынын хабарлайды. Мекен-жайы: Авиагородок көшесі 2'),
      LanguageNotificationPage(
          text:
              '27.09.20 Аудан: 8 шағын ауданы. ТП-344 1СШ жоспарланған жөндеу жұмыстарына байланысты электрмен жабдықтау келесі мекен-жайлар бойынша тоқтатылады: 8 шағын аудан, үй нөмірлері 1-5.'),
      LanguageNotificationPage(
          text:
              '30.09.20 Аудан: Кірпіш ауданы. Кирпичная көшесі,2 үй бағытында D = 219 жылу магистралін кесуге байланысты, ыстық су беру келесі мекен-жайлар бойынша тоқтатылады: Кирпичная көшесі, үй нөмірлері 1-10')
    ];
    return list;
  }
}
